In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("E:/EXCEL WORK/russian_passenger_air_service.csv",convert('Whole year'))

NameError: name 'convert' is not defined

In [ ]:
df.shape

In [ ]:
df_melt=pd.melt(df,id_vars=['Airport name','Year','Airport coordinates','Whole year'],var_name='Months',value_name='Income')

In [ ]:
df_melt.head(2)

In [ ]:
df_melt.shape

In [ ]:
def convert(cell):
    if cell =='0.0':
        return 'nan'
    return 'No'

In [ ]:
df_melt.info

In [ ]:
df_melt[['Airport name','Whole year']]

In [ ]:
df_melt.set_index('Months')

In [ ]:
df_melt.reset_index

In [15]:
scientists = pd.DataFrame(
                data = {'Occupation': ['Chemist', 'Statistician','Nurse','Surgeon','Oncologist'],
                        'Born': ['1920-07-25', '1876-06-13','1950-01-01','1930-02-02','1920-02-02'],
                       'Died': ['1958-04-16', '1937-10-16','2000-02-02','1990-03-03','1980-09-07'],
                       'Age': [37, 61,50,60,60]},
                index = ['Rosaline Franklin','William Gosset','Florence Nightinhgale','Michael scofield','Fox Trevor'],
                columns = ['Occupation', 'Born','Died','Age'])

In [16]:
scientists.to_csv('e://myfiles//scientists.csv',index=False)

In [17]:
df=pd.read_csv('E://myfiles//scientists.csv')

In [18]:
df

     Occupation        Born        Died  Age
0       Chemist  1920-07-25  1958-04-16   37
1  Statistician  1876-06-13  1937-10-16   61
2         Nurse  1950-01-01  2000-02-02   50
3       Surgeon  1930-02-02  1990-03-03   60
4    Oncologist  1920-02-02  1980-09-07   60

In [19]:
df.describe()

             Age
count   5.000000
mean   53.600000
std    10.310189
min    37.000000
25%    50.000000
50%    60.000000
75%    60.000000
max    61.000000

In [20]:
ages=scientists['Age']

In [21]:
ages.mean()

53.6

In [22]:
scientists.iloc[1]

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [24]:
first_row = scientists.iloc[1]

In [25]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [26]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [42]:
born_datetime=pd.to_datetime(df['Born'],format='%Y-%m-%d')

In [43]:
died_borntime=pd.to_datetime(df['Died'],format='%Y-%m-%d')

In [45]:
born_datetime??

In [46]:
df['Born_date']=born_datetime

In [51]:
df['Died Date']=died_datetime

In [54]:
df=df.drop(['Died','Age','Died Date='],axis=1)

In [55]:
df

     Occupation        Born   Born_date   Died Date
0       Chemist  1920-07-25  1920-07-25  1958-04-16
1  Statistician  1876-06-13  1876-06-13  1937-10-16
2         Nurse  1950-01-01  1950-01-01  2000-02-02
3       Surgeon  1930-02-02  1930-02-02  1990-03-03
4    Oncologist  1920-02-02  1920-02-02  1980-09-07

In [56]:
df.to_csv('e://myfiles//scientists.csv')

In [57]:
df.nunique()

Occupation    5
Born          5
Born_date     5
Died Date     5
dtype: int64